import random
from sys import exit

# test Artem
A_cities = ['Абакан', 'Азов', 'Александров', 'Алексин', 'Альметьевск', 'Анапа', 'Ангарск', 'Анжеро-Судженск', 'Апатиты',
            'Арзамас', 'Армавир', 'Арсеньев', 'Артем', 'Архангельск', 'Асбест', 'Астрахань', 'Ачинск']
B_cities = ['Балаково', 'Балахна', 'Балашиха', 'Балашов', 'Барнаул', 'Батайск', 'Белгород', 'Белебей', 'Белово',
            'Белогорск', 'Белорецк', 'Белореченск', 'Бердск', 'Березники', 'Березовский', 'Бийск', 'Биробиджан',
            'Благовещенск', 'Бор', 'Борисоглебск', 'Боровичи', 'Братск', 'Брянск', 'Бугульма', 'Буденновск', 'Бузулук',
            'Буйнакск']
V_cities = ['Видное', 'Владивосток', 'Владикавказ', 'Владимир', 'Волгоград', 'Волгодонск', 'Волжск', 'Волжский',
            'Вологда', 'Вольск', 'Воркута', 'Воронеж', 'Воскресенск', 'Воткинск', 'Всеволожск', 'Выборг', 'Выкса',
            'Вязьма']
G_cities = ['Гатчина', 'Геленджик', 'Георгиевск', 'Глазов', 'Горно-Алтайск', 'Грозный', 'Губкин', 'Гудермес', 'Гуково',
            'Гусь-Хрустальный']
D_cities = ['Дербент', 'Дзержинск', 'Димитровград', 'Дмитров', 'Долгопрудный', 'Домодедово', 'Донской', 'Дубна']
E_cities = ['Евпатория', 'Егорьевск', 'Ейск', 'Екатеринбург', 'Елабуга', 'Елец', 'Ессентуки']
ZH_cities = ['Железногорск', 'Железногорск', 'Жигулевск', 'Жуковский']
Z_cities = ['Заречный', 'Зеленогорск', 'Зеленодольск', 'Златоуст']
I_cities = ['Иваново', 'Ивантеевка', 'Ижевск', 'Избербаш', 'Иркутск', 'Искитим', 'Ишим', 'Ишимбай']
K_cities = ['Казань', 'Калининград', 'Калуга', 'Каменск-Уральский', 'Каменск-Шахтинский', 'Камышин', 'Канск',
            'Каспийск', 'Кемерово', 'Керчь', 'Кинешма', 'Кириши', 'Киров', 'Кирово-Чепецк', 'Киселевск', 'Кисловодск',
            'Клин', 'Клинцы', 'Ковров', 'Когалым', 'Коломна', 'Комсомольск-на-Амуре', 'Копейск', 'Королев', 'Кострома',
            'Котлас', 'Красногорск', 'Краснодар', 'Краснокаменск', 'Краснокамск', 'Краснотурьинск', 'Красноярск',
            'Кропоткин', 'Крымск', 'Кстово', 'Кузнецк', 'Кумертау', 'Кунгур', 'Курган', 'Курск', 'Кызыл']
L_cities = ['Лабинск', 'Лениногорск', 'Ленинск-Кузнецкий', 'Лесосибирск', 'Липецк', 'Лиски', 'Лобня', 'Лысьва',
            'Лыткарино', 'Люберцы']
M_cities = ['Магадан', 'Магнитогорск', 'Майкоп', 'Махачкала', 'Междуреченск', 'Мелеуз', 'Миасс', 'Минеральные-Воды',
            'Минусинск', 'Михайловка', 'Мичуринск', 'Москва', 'Мурманск', 'Муром', 'Мытищи', ]
N_cities = ['Набережные-Челны', 'Назарово', 'Назрань', 'Нальчик', 'Наро-Фоминск', 'Находка', 'Невинномысск', 'Нерюнгри',
            'Нефтекамск', 'Нефтеюганск', 'Нижневартовск', 'Нижнекамск', 'Нижний-Новгород', 'Нижний-Тагил',
            'Новоалтайск', 'Новокузнецк', 'Новокуйбышевск', 'Новомосковск', 'Новороссийск', 'Новосибирск', 'Новотроицк',
            'Новоуральск', 'Новочебоксарск', 'Новочеркасск', 'Новошахтинск', 'Новый-Уренгой', 'Ногинск', 'Норильск',
            'Ноябрьск', 'Нягань']
O_cities = ['Обнинск', 'Одинцово', 'Октябрьский', 'Омск', 'Орел', 'Оренбург', 'Орехово-Зуево', 'Орск']
P_cities = ['Павлово', 'Павловский-Посад', 'Пенза', 'Первоуральск', 'Пермь', 'Петрозаводск', 'Петропавловск-Камчатский',
            'Подольск', 'Полевской', 'Прокопьевск', 'Прохладный', 'Псков', 'Пушкино', 'Пятигорск']
R_cities = ['Раменское', 'Ревда', 'Реутов', 'Ржев', 'Рославль', 'Россошь', 'Ростов-на-Дону', 'Рубцовск', 'Рыбинск',
            'Рязань']
S_cities = ['Салават', 'Сальск', 'Самара', 'Санкт-Петербург', 'Саранск', 'Сарапул', 'Саратов', 'Саров', 'Свободный',
            'Севастополь', 'Северодвинск', 'Северск', 'Сергиев-Посад', 'Серов', 'Серпухов', 'Сертолово', 'Сибай',
            'Симферополь', 'Славянск-на-Кубани', 'Смоленск', 'Соликамск', 'Солнечногорск', 'Сосновый-Бор', 'Сочи',
            'Ставрополь', 'Оскол', 'Стерлитамак', 'Ступино', 'Сургут', 'Сызрань', 'Сыктывкар']
T_cities = ['Таганрог', 'Тамбов', 'Тверь', 'Тимашевск', 'Тихвин', 'Тихорецк', 'Тобольск', 'Тольятти', 'Томск', 'Троицк',
            'Туапсе', 'Туймазы', 'Тула', 'Тюмень']
U_cities = ['Узловая', 'Улан-Удэ', 'Ульяновск', 'Урус-Мартан', 'Усолье-Сибирское', 'Уссурийск', 'Усть-Илимск', 'Уфа',
            'Ухта']
F_cities = ['Феодосия', 'Фрязино']
H_cities = ['Хабаровск', 'Хадыженск', 'Ханты-Мансийск', 'Харабали', 'Харовск', 'Хасавюрт', 'Хвалынск', 'Хилок', 'Химки',
            'Холм', 'Холмск', 'Хотьково']
C_cities = ['Цивильск', 'Цимлянск', 'Циолковский']
CH_cities = ['Чайковский', 'Чапаевск', 'Чебоксары', 'Челябинск', 'Черемхово', 'Череповец', 'Черкесск', 'Черногорск',
             'Чехов', 'Чистополь', 'Чита']
SH_cities = ['Шадринск', 'Шали', 'Шахты', 'Шуя']
SH2_cities = ['Щекино', 'Щелково']
E2_cities = ['Электросталь', 'Элиста', 'Энгельс']
YU_cities = ['Южно-Сахалинск', 'Юрга']
YA_cities = ['Якутск', 'Ялта', 'Ярославль', 'stop']

cities_dict = {'а': A_cities, 'б': B_cities, 'в': V_cities, 'г': G_cities, 'д': D_cities, 'е': E_cities, 'ж': ZH_cities,
             'з': Z_cities, 'и': I_cities, 'к': K_cities, 'л': L_cities, 'м': M_cities, 'н': N_cities, 'о': O_cities,
             'п': P_cities, 'р': R_cities, 'с': S_cities, 'т': T_cities, 'у': U_cities, 'ф': F_cities, 'ц': C_cities,
             'ч': CH_cities, 'ш': SH_cities, 'щ': SH2_cities, 'х': H_cities, 'э': E2_cities, 'ю': YU_cities,
             'я': YA_cities}



all_cities = []
for key, value in cities_dict.items():
    all_cities.extend(value)

start_game_word_1 = random.choice(all_cities)

def delete_word(word_for_delete):
    """удаляет слово из массива городов и возвращает True"""
    word_upper = str(word_for_delete[0].upper() + word_for_delete[1:].lower())
    symbol = word_for_delete[0].lower()
    all_cities.remove(word_upper)
    return True

def check_the_answer(in_word, our_last_word):
    """проверяет ответ пользователя и присваивает True"""
    if in_word[0].lower() == our_last_word[-1]:
        if in_word in all_cities:
            print('Хороший ответ')
            return True
    return False

def game_generall(start_game_word):
    """Основная функция"""
    print(f'Начинаем игру, первое слово - {start_game_word}')
    tail_checked = check_the_tail(start_game_word)
    if check_word in all_cities: delete_word(check_word)
    users_answer = False
    while not users_answer:
        inp = str(input(f'Назовите город на букву - "{tail_checked}"\n'))
        users_answer = check_the_answer(inp, tail_checked)
    delete_word(inp)
    our_answer = find_the_answer(inp[-1])
    print(f'Мой ответ {our_answer}')
    return our_answer

def check_the_answer(in_word, tail_checked):
    """проверяет ответ пользователя и присваивает True"""
    if in_word[0].lower() == tail_checked:
        if in_word in all_cities:
            print('Хороший ответ')
            return True
    return False


def find_the_answer(last_symbol):
    """по введенной букве находит город и присваивает название и последнюю букву"""
    for city in all_cities:
        if city[0].lower() == last_symbol.lower():
            our_answer = city
            continue
    delete_word(our_answer)
    return our_answer


def check_the_tail(word):
    """проверяем на ьЪЙЫ и возвращаем последнюю букву"""
    Eend_symbol = word[-1]
    if Eend_symbol == 'ь' or Eend_symbol == 'ъ' or Eend_symbol == 'ы' or Eend_symbol == 'ё' or Eend_symbol == 'й':
        Eend_symbol = (word[-2])
        if Eend_symbol == 'ы': Eend_symbol = (word[-3])
    return Eend_symbol

check_word = start_game_word_1

while check_word != 'stop':
    check_word = game_generall(check_word)
